# Compound Structure Associate Region With Layer Method

Source: https://www.revitapidocs.com/2026/e0e669e0-97dd-5797-d75d-151fb3634af4.htm

---

| Compound Structure Associate Region With Layer Method |
| --- |

Associates a region with a layer.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void AssociateRegionWithLayer(
	int regionId,
	int layerIdx
)
```

```
Public Sub AssociateRegionWithLayer (
	regionId As Integer,
	layerIdx As Integer
)
```

```
public:
void AssociateRegionWithLayer(
	int regionId,
	int layerIdx
)
```

```
member AssociateRegionWithLayer :
        regionId : int *
        layerIdx : int -> unit
```

#### Parameters

regionId Int32
:   The id of a region.

layerIdx Int32
:   Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | It is not a valid region id. |
| ArgumentOutOfRangeException | The layer index is out of range. |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

See Also

#### Reference

CompoundStructure Class Autodesk.Revit.DB Namespace